<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Tên Package
    |--------------------------------------------------------------------------
    |
    | Đây là tên mặc định của package. Bạn có thể thay đổi tên này nếu cần.
    |
    */
    'name' => 'HenryyHoang Package',

    /*
    |--------------------------------------------------------------------------
    | Đường dẫn lưu file QR Code
    |--------------------------------------------------------------------------
    |
    | Đây là đường dẫn mặc định nơi file QR Code được lưu lại. Bạn có thể
    | thay đổi đường dẫn này tùy thuộc vào cấu trúc dự án của bạn.
    |
    */
    'storage_path' => 'public/qrcodes',

    /*
    |--------------------------------------------------------------------------
    | Kích thước mã QR
    |--------------------------------------------------------------------------
    |
    | Xác định kích thước (width & height) của mã QR được tạo ra.
    |
    */
    'qr_size' => 200,

    /*
    |--------------------------------------------------------------------------
    | Màu nền của mã QR
    |--------------------------------------------------------------------------
    |
    | Đây là màu nền của mã QR, được định dạng theo mã hex.
    |
    */
    'qr_background_color' => '#ffffff',

    /*
    |--------------------------------------------------------------------------
    | Màu của mã QR
    |--------------------------------------------------------------------------
    |
    | Đây là màu của các điểm trong mã QR.
    |
    */
    'qr_color' => '#000000',

    /*
    |--------------------------------------------------------------------------
    | Các tùy chọn khác
    |--------------------------------------------------------------------------
    |
    | Bạn có thể thêm các tùy chọn khác cho package của mình ở đây.
    |
    */
    'options' => [
        // Ví dụ: tùy chọn để điều chỉnh chất lượng hình ảnh
        'quality' => 90,
    ],

];
